Repository: darshpatel008/githubhealth
Catalog: lib/l10n/app_*.arb
Languages: gu, hi

source: Hello World!
gu: હેલો વર્લ્ડ!
hi: हैलो वर्ल्ड!

source: Select Language
gu: ભાષા પસંદ કરો
hi: भाषा चुनें

# hearttitle
source: Heart Failure
gu: હૃદયની નિષ્ફળતા
hi: दिल की धड़कन रुकना

# kidneytitle
source: Kidneys Are Failing
gu: કિડની ફેલ થઈ રહી છે
hi: गुर्दे ख़राब हो रहे हैं

# asthamatitle
source: Asthma:
gu: અસ્થમા
hi: अस्थमा

# breastcancertitle
source: Breast Cancer :
gu: સ્તન કેન્સર:
hi: स्तन कैंसर

# padtitle
source: Peripheral Arterial Disease (PAD):
gu: પેરિફેરલ આર્ટરિયલ ડિસીઝ (PAD)
hi: परिधीय धमनी रोग (पीएडी)

# livertitle
source: Liver Damage:
gu: લીવર નુકસાન:
hi: Lलीवर की क्षति

# lungstitle
source: Lung Cancer:
gu: ફેફસાનું કેન્સર:
hi: फेफड़े का कैंसर

# stresstitle
source: Asthma:
gu: તણાવ
hi: फेफड़े का कैंसर

# breastCancer
source: The main causes and risk factors for breast cancer include: 1. Genetic Mutations: - BRCA1 and BRCA2: Inherited mutations in these genes increase the risk of developing breast cancer. These mutations significantly raise the risk of breast and ovarian cancers. 2. Family History: - Having a family history of breast cancer, especially in close relatives (mother, sister, daughter), increases the risk. 3. Age: - The risk of breast cancer increases with age. Most cases are diagnosed in women over 50. 4. Hormonal Factors: - Early Menstruation: Starting menstruation before age 12. - Late Menopause: Menopause occurring after age 55. - Hormone Replacement Therapy (HRT): Long-term use of combined estrogen and progesterone therapy. 5. Lifestyle Factors: - Alcohol Consumption: Regular and excessive alcohol intake is linked to a higher risk of breast cancer. - Obesity and Overweight: Excess body weight, particularly after menopause, is associated with an increased risk. - Physical Inactivity: Lack of regular physical exercise can contribute to a higher risk. 6. Reproductive History: - Late First Pregnancy: Having your first child after age 30 or not having children at all can increase risk. - No Breastfeeding: Not breastfeeding may slightly increase the risk. 7. Radiation Exposure: - Previous radiation treatment to the chest area, such as for other cancers, can increase breast cancer risk. 8. Dense Breast Tissue: - Women with dense breast tissue may have a higher risk of developing breast cancer. 9. Personal History of Breast Cancer: - Women who have had breast cancer before are at an increased risk of developing it again in the other breast or another part of the same breast. While these factors can increase the risk, having one or more of them does not guarantee that a person will develop breast cancer. Regular screenings and a healthy lifestyle can help in managing risk. Preventive Measures for breast cancer: - Regular Screenings: - Mammograms: Regular mammograms can help detect breast cancer early. Women should start regular screenings at age 40 or earlier if they have a family history or other risk factors. - Clinical Breast Exams: Regular exams by a healthcare provider can also aid in early detection. - Self-Exams: - Perform regular breast self-exams to become familiar with how your breasts normally feel and to notice any changes. Although self-exams are not a substitute for mammograms, they can help in early detection. - Healthy Lifestyle: - Balanced Diet: Eat a diet rich in fruits, vegetables, whole grains, and lean proteins while limiting saturated fats and processed foods. - Regular Exercise: Aim for at least 30 minutes of moderate exercise most days of the week to maintain a healthy weight and reduce risk. - Maintain a Healthy Weight: Being overweight, especially after menopause, is linked to a higher risk of breast cancer. - Limit Alcohol Consumption: - Drink alcohol in moderation, as excessive alcohol intake is associated with an increased risk of breast cancer. - Avoid Smoking: - Quitting smoking can reduce the risk of developing various cancers, including breast cancer. - Hormone Therapy: - If you are considering hormone replacement therapy (HRT) for menopausal symptoms, discuss with your healthcare provider the risks and benefits, and explore alternatives. - Genetic Testing: - If you have a family history of breast cancer or other risk factors, consider genetic testing for BRCA1 and BRCA2 mutations to assess your risk. - Preventive Surgery: - For women with a very high risk of breast cancer (e.g., those with BRCA mutations), options like prophylactic mastectomy (preventive removal of breasts) may be considered. - Regular Checkups: - Regular visits to a healthcare provider for overall health and breast cancer risk management. - Breastfeeding: - Breastfeeding for several months can slightly lower the risk of breast cancer.
gu: સ્તન કેન્સરના મુખ્ય કારણો અને જોખમી પરિબળોમાં નીચેનાનો સમાવેશ થાય છેઃ 1. આનુવંશિક પરિવર્તન બી. આર. સી. એ. 1 અને બી. આર. સી. એ. 2: આ જનીનોમાં વારસાગત પરિવર્તન સ્તન કેન્સર થવાનું જોખમ વધારે છે. આ પરિવર્તનો સ્તન અને અંડાશયના કેન્સરનું જોખમ નોંધપાત્ર રીતે વધારે છે. 2. કૌટુંબિક ઇતિહાસઃ -સ્તન કેન્સરનો પારિવારિક ઇતિહાસ હોવો, ખાસ કરીને નજીકના સંબંધીઓ (માતા, બહેન, પુત્રી) માં જોખમ વધે છે. 3. ઉંમરઃ -સ્તન કેન્સરનું જોખમ ઉંમર સાથે વધે છે. મોટાભાગના કેસો 50 વર્ષથી વધુ ઉંમરની સ્ત્રીઓમાં નિદાન થાય છે. 4. હોર્મોનલ પરિબળોઃ પ્રારંભિક માસિક સ્રાવઃ 12 વર્ષની ઉંમર પહેલાં માસિક સ્રાવ શરૂ કરવો. અંતમાં મેનોપોઝ : 55 વર્ષની ઉંમર પછી મેનોપોઝ થાય છે. હોર્મોન રિપ્લેસમેન્ટ થેરપી (એચઆરટી) : સંયુક્ત એસ્ટ્રોજન અને પ્રોજેસ્ટેરોન ઉપચારનો લાંબા ગાળાનો ઉપયોગ. 5. જીવનશૈલીના પરિબળોઃ દારૂ પીવોઃ નિયમિત અને વધુ પડતા આલ્કોહોલનું સેવન સ્તન કેન્સરના ઊંચા જોખમ સાથે સંકળાયેલું છે. - સ્થૂળતા અને વધારે વજન : શરીરનું વધારાનું વજન, ખાસ કરીને મેનોપોઝ પછી, વધેલા જોખમ સાથે સંકળાયેલું છે. - શારીરિક નિષ્ક્રિયતાઃ નિયમિત શારીરિક કસરતનો અભાવ વધુ જોખમમાં ફાળો આપી શકે છે. 6. પ્રજનન ઇતિહાસઃ અંતમાં પ્રથમ ગર્ભાવસ્થા : 30 વર્ષની ઉંમર પછી તમારું પ્રથમ બાળક હોવું અથવા બિલકુલ બાળકો ન હોવા જોખમ વધારી શકે છે. - સ્તનપાન ન કરવું : સ્તનપાન ન કરવાથી જોખમમાં થોડો વધારો થઈ શકે છે. 7. રેડિયેશન એક્સપોઝરઃ -છાતીના વિસ્તારમાં અગાઉની રેડિયેશન સારવાર, જેમ કે અન્ય કેન્સર માટે, સ્તન કેન્સરનું જોખમ વધારી શકે છે. 8. ગાઢ સ્તન પેશીઃ -ગાઢ સ્તન પેશીઓ ધરાવતી સ્ત્રીઓને સ્તન કેન્સર થવાનું જોખમ વધારે હોઈ શકે છે. 9. સ્તન કેન્સરનો વ્યક્તિગત ઇતિહાસઃ -જે સ્ત્રીઓને પહેલાં સ્તન કેન્સર થયું હોય તેમને અન્ય સ્તનમાં અથવા તે જ સ્તનના અન્ય ભાગમાં ફરીથી તે વિકસાવવાનું જોખમ વધારે છે. જ્યારે આ પરિબળો જોખમમાં વધારો કરી શકે છે, તેમાંના એક અથવા વધુ હોવા એ બાંયધરી આપતું નથી કે વ્યક્તિને સ્તન કેન્સર થશે. નિયમિત તપાસ અને તંદુરસ્ત જીવનશૈલી જોખમનું સંચાલન કરવામાં મદદ કરી શકે છે. સ્તન કેન્સર માટે નિવારક પગલાંઃ નિયમિત સ્ક્રિનિંગઃ નિયમિત મેમોગ્રામ સ્તન કેન્સરને વહેલું શોધવામાં મદદ કરી શકે છે. જો મહિલાઓનો પારિવારિક ઇતિહાસ અથવા અન્ય જોખમી પરિબળો હોય તો તેમણે 40 વર્ષ કે તેથી વધુ ઉંમરથી નિયમિત સ્ક્રિનિંગ શરૂ કરવું જોઈએ. - ક્લિનિકલ સ્તન પરીક્ષાઓ : આરોગ્ય સંભાળ પ્રદાતા દ્વારા નિયમિત પરીક્ષાઓ પણ વહેલું નિદાન કરવામાં મદદ કરી શકે છે. - સ્વ-પરીક્ષાઓઃ -તમારા સ્તનો સામાન્ય રીતે કેવું અનુભવે છે તેનાથી પરિચિત થવા અને કોઈપણ ફેરફારોની નોંધ લેવા માટે નિયમિત સ્તન સ્વ-પરીક્ષાઓ કરો. જોકે સ્વ-પરીક્ષાઓ મેમોગ્રામનો વિકલ્પ નથી, તેમ છતાં તેઓ વહેલી તપાસ કરવામાં મદદ કરી શકે છે. સંતુલિત આહારઃ સંતૃપ્ત ચરબી અને પ્રોસેસ્ડ ખોરાકને મર્યાદિત કરતી વખતે ફળો, શાકભાજી, આખા અનાજ અને દુર્બળ પ્રોટીનથી સમૃદ્ધ આહાર લો. નિયમિત વ્યાયામ : તંદુરસ્ત વજન જાળવવા અને જોખમ ઘટાડવા માટે અઠવાડિયાના મોટાભાગના દિવસોમાં ઓછામાં ઓછી 30 મિનિટની મધ્યમ કસરત કરવાનું લક્ષ્ય રાખો. - તંદુરસ્ત વજન જાળવી રાખો : વધુ પડતું વજન હોવું, ખાસ કરીને મેનોપોઝ પછી, સ્તન કેન્સરના ઊંચા જોખમ સાથે સંકળાયેલું છે. આલ્કોહોલનું સેવન મર્યાદિત કરોઃ -દારૂ મધ્યમ માત્રામાં પીવો, કારણ કે વધુ પડતા આલ્કોહોલનું સેવન સ્તન કેન્સરના વધતા જોખમ સાથે સંકળાયેલું છે. ધૂમ્રપાન ટાળોઃ ધૂમ્રપાન છોડવાથી સ્તન કેન્સર સહિત વિવિધ કેન્સર થવાનું જોખમ ઘટાડી શકાય છે. હોર્મોન થેરપીઃ જો તમે મેનોપોઝલ લક્ષણો માટે હોર્મોન રિપ્લેસમેન્ટ થેરાપી (એચઆરટી) પર વિચાર કરી રહ્યા હો, તો તમારા આરોગ્યસંભાળ પ્રદાતા સાથે જોખમો અને ફાયદાઓની ચર્ચા કરો અને વિકલ્પો શોધો. આનુવંશિક પરીક્ષણઃ જો તમારી પાસે સ્તન કેન્સર અથવા અન્ય જોખમી પરિબળોનો પારિવારિક ઇતિહાસ હોય, તો તમારા જોખમનું મૂલ્યાંકન કરવા માટે બીઆરસીએ 1 અને બીઆરસીએ 2 પરિવર્તન માટે આનુવંશિક પરીક્ષણનો વિચાર કરો. - પ્રિવેન્ટિવ સર્જરીઃ -સ્તન કેન્સરનું ખૂબ ઊંચું જોખમ ધરાવતી સ્ત્રીઓ માટે (દા. ત., બીઆરસીએ પરિવર્તન ધરાવતા લોકો) પ્રોફીલેક્ટીક મેસ્ટેક્ટોમી (સ્તનોની નિવારક દૂર) જેવા વિકલ્પો ધ્યાનમાં લેવામાં આવી શકે છે. - નિયમિત તપાસઃ -એકંદર આરોગ્ય અને સ્તન કેન્સરના જોખમ વ્યવસ્થાપન માટે આરોગ્ય સંભાળ પ્રદાતાની નિયમિત મુલાકાત. - સ્તનપાનઃ -કેટલાંક મહિનાઓ સુધી સ્તનપાન કરવાથી સ્તન કેન્સરનું જોખમ થોડું ઓછું થઈ શકે છે.
hi: स्तन कैंसर के मुख्य कारणों और जोखिम कारकों में शामिल हैंः 1. आनुवंशिक उत्परिवर्तनः बी. आर. सी. ए. 1 और बी. आर. सी. ए. 2: इन जीनों में वंशानुगत उत्परिवर्तन स्तन कैंसर के विकास के जोखिम को बढ़ाते हैं। ये उत्परिवर्तन स्तन और डिम्बग्रंथि के कैंसर के खतरे को काफी बढ़ाते हैं। 2. पारिवारिक इतिहासः -स्तन कैंसर का पारिवारिक इतिहास होना, विशेष रूप से करीबी रिश्तेदारों (मां, बहन, बेटी) में जोखिम बढ़ जाता है। 3. उम्रः-उम्र बढ़ने के साथ स्तन कैंसर का खतरा बढ़ जाता है। अधिकांश मामलों का निदान 50 वर्ष से अधिक उम्र की महिलाओं में किया जाता है। 4. हार्मोनल कारक प्रारंभिक मासिक धर्मः 12 वर्ष की आयु से पहले मासिक धर्म शुरू होना। देर से रजोनिवृत्ति : 55 वर्ष की आयु के बाद होने वाला रजोनिवृत्ति। हार्मोन रिप्लेसमेंट थेरेपी (एचआरटी) : संयुक्त एस्ट्रोजन और प्रोजेस्टेरोन थेरेपी का दीर्घकालिक उपयोग। 5. जीवनशैली के कारकः शराब का सेवनः नियमित और अत्यधिक शराब का सेवन स्तन कैंसर के उच्च जोखिम से जुड़ा हुआ है। - मोटापा और अधिक वजन : शरीर का अधिक वजन, विशेष रूप से रजोनिवृत्ति के बाद, एक बढ़े हुए जोखिम से जुड़ा हुआ है। - शारीरिक निष्क्रियताः नियमित शारीरिक व्यायाम की कमी उच्च जोखिम में योगदान कर सकती है। 6. प्रजनन इतिहासः - देर से पहली गर्भावस्था : 30 साल की उम्र के बाद आपका पहला बच्चा होना या बच्चे न होने से जोखिम बढ़ सकता है। - स्तनपान न करना : स्तनपान न करने से जोखिम थोड़ा बढ़ सकता है। 7. रेडिएशन एक्सपोजरः -छाती के क्षेत्र में पिछले रेडिएशन उपचार, जैसे कि अन्य कैंसर के लिए, स्तन कैंसर के जोखिम को बढ़ा सकते हैं। 8. घने स्तन ऊतकः-घने स्तन ऊतक वाली महिलाओं में स्तन कैंसर होने का खतरा अधिक हो सकता है। 9. स्तन कैंसर का व्यक्तिगत इतिहासः -जिन महिलाओं को पहले स्तन कैंसर हुआ है, उन्हें दूसरे स्तन या उसी स्तन के किसी अन्य हिस्से में इसे फिर से विकसित करने का खतरा बढ़ जाता है। जबकि ये कारक जोखिम को बढ़ा सकते हैं, उनमें से एक या अधिक होने से यह गारंटी नहीं मिलती है कि किसी व्यक्ति को स्तन कैंसर हो जाएगा। नियमित जांच और एक स्वस्थ जीवन शैली जोखिम के प्रबंधन में मदद कर सकती है। स्तन कैंसर के लिए निवारक उपायः नियमित जांचः नियमित मैमोग्राम स्तन कैंसर का जल्दी पता लगाने में मदद कर सकते हैं। महिलाओं को 40 वर्ष या उससे पहले की आयु में नियमित रूप से जाँच शुरू कर देनी चाहिए यदि उनका पारिवारिक इतिहास या अन्य जोखिम कारक हैं। - नैदानिक स्तन परीक्षा : एक स्वास्थ्य सेवा प्रदाता द्वारा नियमित परीक्षा भी जल्दी पता लगाने में सहायता कर सकती है। - स्व-परीक्षाः -आपके स्तन सामान्य रूप से कैसा महसूस करते हैं और किसी भी परिवर्तन को नोटिस करने के लिए नियमित रूप से स्तन स्व-परीक्षा करें। हालाँकि आत्म-परीक्षण मैमोग्राम का विकल्प नहीं हैं, लेकिन वे जल्दी पता लगाने में मदद कर सकते हैं। संतुलित आहारः संतृप्त वसा और प्रसंस्कृत खाद्य पदार्थों को सीमित करते हुए फल, सब्जियां, साबुत अनाज और लीन प्रोटीन से भरपूर आहार लें। नियमित व्यायाम : स्वस्थ वजन बनाए रखने और जोखिम को कम करने के लिए सप्ताह के अधिकांश दिनों में कम से कम 30 मिनट के मध्यम व्यायाम का लक्ष्य रखें। - स्वस्थ वजन बनाए रखें : अधिक वजन होना, विशेष रूप से रजोनिवृत्ति के बाद, स्तन कैंसर के उच्च जोखिम से जुड़ा हुआ है। शराब का सेवन सीमित करेंः शराब का सेवन सीमित मात्रा में करें, क्योंकि अत्यधिक शराब का सेवन स्तन कैंसर के बढ़ते जोखिम से जुड़ा हुआ है। धूम्रपान से बचेंः धूम्रपान छोड़ने से स्तन कैंसर सहित विभिन्न कैंसर के विकास का खतरा कम हो सकता है। हार्मोन थेरेपीः यदि आप रजोनिवृत्ति के लक्षणों के लिए हार्मोन रिप्लेसमेंट थेरेपी (एचआरटी) पर विचार कर रहे हैं, तो अपने स्वास्थ्य सेवा प्रदाता के साथ जोखिमों और लाभों पर चर्चा करें, और विकल्पों का पता लगाएं। - आनुवंशिक परीक्षणः -यदि आपके पास स्तन कैंसर या अन्य जोखिम कारकों का पारिवारिक इतिहास है, तो अपने जोखिम का आकलन करने के लिए बीआरसीए1 और बीआरसीए2 उत्परिवर्तन के लिए आनुवंशिक परीक्षण पर विचार करें। - निवारक सर्जरीः -स्तन कैंसर के बहुत अधिक जोखिम वाली महिलाओं के लिए (e.g., बीआरसीए उत्परिवर्तन वाले) रोगनिरोधी मास्टेक्टोमी (स्तनों को निवारक हटाने) जैसे विकल्पों पर विचार किया जा सकता है। नियमित जाँचः समग्र स्वास्थ्य और स्तन कैंसर जोखिम प्रबंधन के लिए स्वास्थ्य सेवा प्रदाता के पास नियमित रूप से जाएँ। - स्तनपानः-कई महीनों तक स्तनपान कराने से स्तन कैंसर का खतरा थोड़ा कम हो सकता है।
